In [4]:

import pandas as pd

In [5]:
### Homework task-1


file_path = 'C:/Users/Sake/Desktop/names/'

In [7]:

def counting_top_3(file):
    
    return pd.concat([pd.read_csv(f'{file_path}/yob{line}.txt', names = ['Name', 'Gender', 'Number']) for line in file], 
                     ignore_index=True).groupby(by='Name').sum().sort_values(by='Number', ascending=False).head(3)

In [8]:
counting_top_3([1880])

         Number
Name
John       9701
William    9562
Mary       7092

In [9]:
counting_top_3([1900, 1950, 2000])

        Number
Name
James   111789
John    109601
Robert  101368

In [10]:
### Homework task-2


def counting_dynamics(file):
    
    return pd.concat([pd.read_csv(f'{file_path}/yob{line}.txt', names = ['Name', 'Gender', 'Number']).assign(Year = line)  for line in file], 
                     ignore_index=True).groupby(['Gender', 'Year']).agg({'Number': 'sum'})

In [11]:
counting_dynamics([1900, 1950, 2000])

              Number
Gender Year
F      1900   299798
       1950  1713065
       2000  1815295
M      1900   150480
       1950  1790437
       2000  1963202

In [12]:
primary_dynamics = counting_dynamics([1900, 1950, 2000])

normalized_dynamics = primary_dynamics.unstack('Gender')

normalized_dynamics

         Number
Gender        F        M
Year
1900     299798   150480
1950    1713065  1790437
2000    1815295  1963202